---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailEndExtensionLengthParam
source: html/1180f42c-b4cc-d109-b34b-43b3beb910f7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailEndExtensionLengthParam Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailEndExtensionLengthParam { get; }
```